public class Main {
    public static void main(String[] args) {

        int TicketPrice = 54_899;
        int mile = 20;

        int bonus = TicketPrice / 20;

        System.out.println("Итоговый бонус:" + bonus);


        // Объявляете переменные для входных данных и
        // параметров программы: одну для хранения
        // стоимости билета, другую для хранения количества
        // рублей для одной бонусной мили

        // Рассчитываете количество бонусных миль, используя
        // значения заведённых переменных. Ответ сохраняете в
        // новую переменную и выводите на экран
    }
}